QGDsolver/tutorials/reactingQGDFoam/1D/Abgrall/constant/reactions
species
(
    He
    air
);

reactions
{
}
